/*
সিনক্রোনাস এবং এসিনক্রোনাস দুটি প্রোগ্রামিং স্টাইল বা প্যারাডাইম হলো দুটি ভিন্ন ধরনের কোড এরকম যা প্রোগ্রামের নির্দিষ্ট কাজের মাধ্যমে প্রোগ্রাম চালাতে সাহায্য করে।

Simple কাজের জন্য সিনক্রোনাস (Synchronous): Loading হয় - Call Back নেই

-> সিনক্রোনাস প্রোগ্রামিং স্টাইলে একটি কাজ শেষ হতে অপেক্ষা করতে হয়।
-> একটি কাজ শেষ হোলে তার পরের কাজটি চালু হয়।
-> এটি সহজে বুঝা যায়, কিন্তু এটি ব্লকিং হওয়ার সম্ভাবনা রয়েছে, এটির জন্য প্রোগ্রাম আপনার -> প্রক্রিয়া বন্ধ হতে পারে এবং এটি বিশেষভাবে কাজগুলির মধ্যে একটি সম্পন্ন হওয়ার সময় নিতে পারে।

Heavy কাজের জন্য এসিনক্রোনাস (Asynchronous): Loading হয় না - Call Back আছে 

-> এসিনক্রোনাস প্রোগ্রামিং স্টাইলে একটি কাজ শেষ হতে অপেক্ষা না করে পরবর্তী কাজটি চালু হয়।
-> একটি কাজ শেষ হওয়া তা প্রোগ্রামের বিচরণে কোনো প্রভাব ফেলতে পারে না।
-> এটি ব্যবহারকারীদের জন্য ভাল যখন প্রোগ্রামটি একে অপরের সাথে ইন্টারঅ্যাক্ট করতে হবে, ডাটা লোড করতে হবে, এবং সময়কাল কাজ করতে হবে যা একটি ব্লকিং অপারেশনের জন্য অপ্টিমাইজড হতে পারে।-> 
*/