/*
package.json হলো একটি জাভাস্ক্রিপ্ট প্রজেক্ট এবং অন্যান্য প্রোগ্রামিং ভাষার জন্য ব্যবহৃত হোস্টিং সাইটের একটি কনফিগারেশন ফাইল। এই ফাইলে প্রজেক্টের তথ্য, ডিপেন্ডেন্সি (dependencies), স্ক্রিপ্ট, এবং অন্যান্য কনফিগারেশন তথ্য থাকে।

package.json ফাইলে সাধারিত তথ্য সহজে পাওয়া যায়, তা হলো:

name: প্রজেক্টের নাম। এটি অনুসন্ধানের জন্য npm প্যাকেজ রেজিস্ট্রিতে ইউনিক হতে হবে।
version: প্রজেক্টের সংষ্করণ নাম্বার।
main: মেইন জাভাস্ক্রিপ্ট ফাইলের নাম, যেটি প্রজেক্টের এন্ট্রি পয়েন্ট।
scripts: প্রজেক্টে ব্যবহৃত হতে স্ক্রিপ্ট কমান্ডের ম্যাপ।
dependencies: প্রজেক্টের মূল ডিপেন্ডেন্সিগুলি যেগুলি ইউজ করা হচ্ছে সেগুলির তালিকা।
devDependencies: ডেভেলপমেন্ট এবং টেস্ট প্রোজেক্ট মোডে মাত্র ইউজ করা যাবে সেই ডিপেন্ডেন্সিগুলির তালিকা।
package.json ফাইলের মাধ্যমে এই সমস্ত তথ্য সহজে অনুসন্ধান করা এবং প্রজেক্ট নির্মাণ, টেস্ট, ডিপ্লয়মেন্ট এবং অন্যান্য প্রক্রিয়াগুলির জন্য ম্যাপ করা যায়।

Example 
=======

{
  "name": "module-7-node-js",
  "version": "1.0.0",
  "description": "",
  "main": "main.js",
  "scripts": {
    "test": "echo \"Error: no test specified\" && exit 1",
    "start": "node main.js"
  },
  "keywords": [],
  "author": "",
  "license": "ISC"
}

*/
